# Notebook para exploração do dataset

Exploração de dados do dataset "BANES Energy Data Electricity".

Colunas do dataset:

- **ID** - text
- **Data** -  timestamp
- **Location** 	- Text
- **PostCode** -	 Text
- **Units** -	 Text
- **TotalUnits** -	 Numeric
- **00:30** até **24:00** - Numeric
- **MPAN** - Text
- **MSID** - Text

In [15]:
# import libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.read_csv('BANES.csv')
df.head()

,id,date,location,postcode,units,totalunits,_00_30,_01_00,_01_30,_02_00,...,_20_30,_21_00,_21_30,_22_00,_22_30,_23_00,_23_30,_24_00,mpan,msid
0,b7041f9c6e37c356a08dc9e116db2d02,2017-11-14T00:00:00+00:00,Infants School - Main School 2,BA2 1LG,kWh,125.602,0.452,0.485,0.443,0.464,...,0.531,0.548,0.541,0.480,0.572,0.477,0.540,0.509,2.200013e+12,E12BG00542
1,016c483021d1658579e21c452283fdf8,2016-07-24T00:00:00+00:00,Infants School - Hot Water,BA2 1LG,kWh,0.002,0.000,0.000,0.000,0.001,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,2.200013e+12,E12BG05597
2,6e4157799066e9af580d66f7d6639dc8,2017-02-05T00:00:00+00:00,Infants School - Kitchen,BA2 1LG,kWh,15.080,0.343,0.270,0.202,0.199,...,0.339,0.282,0.333,0.362,0.317,0.293,0.320,0.279,2.200013e+12,E12BG05598
3,38e91f884c7d7390ee7d01cd2f9390f3,2016-04-24T00:00:00+00:00,Infants School - Main School 2,BA2 1LG,kWh,26.122,0.448,0.476,0.469,0.417,...,0.503,0.458,0.463,0.518,0.531,0.436,0.458,0.519,2.200013e+12,E12BG00542
4,d7c380269879bec87f3d5c72e7bf08c0,2013-04-29T00:00:00+00:00,Infants School - Main School 2,BA2 1LG,kWh,130.252,0.885,0.723,0.841,0.959,...,1.167,1.053,0.979,1.003,0.960,0.954,0.997,1.015,2.200013e+12,E12BG00542

In [3]:
# number of unique id's
print("Unique id's:", df['id'].nunique())
print("Shape of dataframe:", df.shape)

# number of unique units column
print("Unique units's column", df['units'].nunique())

Unique id's: 166259
Shape of dataframe: (166276, 56)
Unique units's column 1

The column `units` is unnecessary, since there is only one value: ``kWh``, so we'll remove that column.

Same thing with the column `id`. Every line of the dataset has a unique id, which makes it redundant. We'll also remove that column.

In [4]:
# drop columns units and id
df.drop(['units', 'id'], axis=1, inplace=True)

#### About the dataset

This dataset contains a ``postcode`` column and a ``location`` column. We'll find out exactly what these columns mean.

In [5]:
print("Number of unique postcodes", df['postcode'].nunique(), "\n")

print("Unique postcodes:\n", df['postcode'].unique())

Number of unique postcodes 30

Unique postcodes:
 ['BA2 1LG' 'BA1 1NH' 'BS39 5XD' 'BA2 1QR' 'BA1 1LN' 'BS39 7QY' 'BA2 7WE'
 'BA2 3PL' 'BS39 4AA' 'BA2 2RQ' 'BA2 9HS' 'BA2 3NR' 'BS39 7QG' 'BA1 2QN'
 'BS31 2TS' 'BA1 5AW' 'BA1 1JG' 'BS31 3DW' 'BA3 2DA' 'BA1 5AL' 'BS39 4EQ'
 'BA1 6ND' 'BS31 1FS' 'BA3 3XX' 'BA1 6RB' 'BA1 6NY' 'BA3 2DP' 'BA3 3QQ'
 'BS31 3DJ' 'BA1 4BU']

In [6]:
print("Number of unique locations", df['location'].nunique(), "\n")

print("Unique locations:\n", df['location'].unique()[:10], "...")

Number of unique locations 72

Unique locations:
 ['Infants School - Main School 2' 'Infants School - Hot Water'
 'Infants School - Kitchen' 'Infants School - Main School 1'
 'Swallow Street Stores & Workshop Electri'
 'Bishop Sutton Primary School Electricity'
 'Twerton Infant School Electricity Supply'
 '##Northgate House Electricity Supply 2'
 'Paulton Junior School Electricity Supply'
 'Freshford C of E Primary Electricity Sup'] ...

In [7]:
# for each location, find all postcodes are associated with it
# and print them if there are more than one
for location in df['location'].unique():
    if df[df['location'] == location]['postcode'].nunique() > 1:
        print(location, df[df['location'] == location]['postcode'].unique())

Each ``location`` is associated with one and only ``postcode``.

#### Other things about the dataset

- The postcodes are mostly of the city of Bath, UK
- The locations are only of public buildings, mostly schools

#### Next step

Find *dirty* values in the dataset.

In [8]:
# find null values
print("\nNumber of null values:", df.isnull().sum().sum())

Number of null values: 5100

In [9]:
print("Columns with null values:")
df.columns[df.isnull().sum() > 0]

Columns with null values:

Index(['mpan', 'msid'], dtype='object')

In [10]:
print("Unique values of mpan and msid:")
df['mpan'].nunique(), df['msid'].nunique()

Unique values of mpan and msid:

(57, 57)

There are 57 values, which means it may not be a good idea to remove these columns.

In [11]:
print("Postcode where mpan or msid is null:")
print("mpan:", df[df['mpan'].isnull()]['postcode'].unique())
print("msid:", df[df['msid'].isnull()]['postcode'].unique())

Postcode where mpan or msid is null:
mpan: ['BS31 1FS']
msid: ['BS31 1FS']

In [12]:
# lines with postcode 'BS31 1FS' where mpan is not null
print("Lines with postcode 'BS31 1FS' where mpan is not null:")
df[(df['postcode'] == 'BS31 1FS') & (df['mpan'].notnull())].shape[0]

Lines with postcode 'BS31 1FS' where mpan is not null:

1997

In [13]:
# lines with postcode 'BS31 1FS' where msid is not null
print("Lines with postcode 'BS31 1FS' where msid is not null:")
df[(df['postcode'] == 'BS31 1FS') & (df['msid'].notnull())].shape[0]

Lines with postcode 'BS31 1FS' where msid is not null:

1997

``mpan`` and ``msid`` are a controller identifier, these columns are often not important, so we'll leave the *NaN* values.

#### Negative values

The values from the hour usage should always be >= 0, so if there are negative values they should be discarded.

In [14]:
# find negative values in all rows
for col, val in df.iloc[:, 4:-2].apply(lambda x: x[x < 0].shape[0], axis=0).iteritems():
    print(col, val) if val > 0 else None

_02_30 9
_15_00 5
_17_30 3
_20_00 1
_20_30 1
_22_00 1

There are negative values in the columns ``_02_30``, ``_15_00``, ``_17_30``, ``_20_00``, ``_20_30``, ``_22_00``.

These values should be rejected, since the usage is never negative, it can only be larger or equal to 0.

In [24]:
# for all rows, if there is a negative value in a column, print the row
to_remove = []
for col, val in df.iloc[:, 4:-2].apply(lambda x: x[x < 0].shape[0], axis=0).iteritems():
    if val > 0:
        print(df[df[col] < 0].loc[:, ['postcode', 'location', col]])
        to_remove.append(df[df[col] < 0].index)

       postcode                                location        _02_30
74166  BS31 1FS    First Floor Disabled WC Water Heater -3.800000e-07
75361  BS31 1FS   Ground Floor Disabled WC Water Heater -1.530000e-06
81418  BS31 1FS             First Floor WC Water Heater -1.900000e-07
81637  BS31 1FS  First Floor Kitchenenette Water Heater -7.600000e-07
81770  BS31 1FS                    Air cooled chiller 1 -2.441000e-05
81781  BS31 1FS   Ground Floor Disabled WC Water Heater -1.530000e-06
81871  BS31 1FS  First Floor Kitchenenette Water Heater -1.530000e-06
81947  BS31 1FS    First Floor Disabled WC Water Heater -1.900000e-07
82167  BS31 1FS             First Floor WC Water Heater -1.000000e-07
       postcode                                location        _15_00
68730  BS31 1FS  First Floor Kitchenenette Water Heater -1.530000e-06
81298  BS31 1FS                     AirCooled Chiller 2 -2.452160e+07
81374  BS31 1FS                    Air cooled chiller 1 -6.728121e+07
83885  BS31 1FS                     AirCooled Chiller 2 -2.452160e+07
83886  BS31 1FS                    Air cooled chiller 1 -6.728121e+07
       postcode                               location        _17_30
64810  BS31 1FS            First Floor WC Water Heater -1.000000e-07
68123  BS31 1FS  Ground Floor Disabled WC Water Heater -1.530000e-06
68575  BS31 1FS   First Floor Disabled WC Water Heater -1.900000e-07
       postcode              location    _20_00
81527  BS31 1FS  Air cooled chiller 1 -0.000012
       postcode                       location    _20_30
82433  BS31 1FS  Ground Floor South - Lighting -0.000781
       postcode              location    _22_00
78877  BS31 1FS  Air cooled chiller 1 -0.000024

These are the rows that are going to be eliminated, since they contain negative values.

In [29]:
to_remove = [b for a in to_remove for b in a]
to_remove

[74166,
 75361,
 81418,
 81637,
 81770,
 81781,
 81871,
 81947,
 82167,
 68730,
 81298,
 81374,
 83885,
 83886,
 64810,
 68123,
 68575,
 81527,
 82433,
 78877]

In [30]:
# remove all rows with the indexs in to_remove
df.drop(to_remove, axis=0, inplace=True)

The dataset is now *clean*.

#### Changes to dataset summary

- Drop columns `units` and `id`
- Drop rows with negative values

#### Next step

Export the *clean* dataset, and join the weather info.

In [31]:
# export the dataframe to csv
df.to_csv('BANES_cleaned.csv', index=False)